{
    "data": {
        "location": "London, UK",
        "socials": [
            ["linkedin","https://www.linkedin.com/in/vladluchian/"],
            ["github","https://github.com/cstml"]
        ],
        "name": "Vlad Posmangiu Luchian",
        "email": "vladposmangiu (at) gmail (replace with a dot) com",
        "interests": [
            {"headline":"Compilers"},
            {"headline":"Web Apps"},
            {"headline":"Type Systems"}
        ],
        "projects": [
            {
                "name": "LambdaBuffers",
                "link": "https://mlabs-haskell.github.io/lambda-buffers/",
                "description": "LambdaBuffers is a schema language (similar to ProtoBuffers, ADL, ASN.1, JSON Schema, etc.) and associated code generation toolkit.",
                "emoji": ":t-rex:"
            },
            {
                "name": "GHAppy",
                "link": "https://github.com/mlabs-haskell/GHAppy",
                "description": "A utility to pull issues and create documents - leveraging Pandoc.",
                "emoji": ":book:"
            },
            {
                "name": "Spacelang",
                "link": "https://github.com/cstml/spacelang",
                "description": "A CL implementation of spacelang.",
                "emoji": ":astronaut:"
            },
            {
                "name": "Space",
                "link":"",
                "description": "A declarative, concatenative stack programing language. Pre-Alpha. ",
                "emoji": ":astronaut:"
            },
            {
                "name": "FMCt",
                "link": "https://github.com/cstml/FMCt",
                "description": "Functional Machine Calculus typed. A programming language based on the FMC paper.",
                "emoji": ":robot:"
            }
        ],
        "intro": [
            ":wave:Hi. I am a senior software engineer with experience spanning from fin-tech, compliance, and banking, to cryptocurrencies and building construction software.:chart_with_upwards_trend:",
            "Creative problem-solving drives me, and I believe in thoroughly analysing the problem domain and its constraints to provide an elegant and customised solution. My passions include functional programming, programming language theory, reinforcement learning, and distributed systems architecture. I am continually exploring the interplay between mathematics, data, and our comprehension of the world and am always on the hunt for the \"perfect\" tool or solution to bring my ideas to fruition. In my previous collaborations, I have worked alongside cross-functional teams, including technology and business teams, and understand the significance of teamwork and communication in delivering successful projects."
        ] 
    },
    "jobs":[
        {
            "company": "Griffin Bank",
            "description": "I work as an individual contributor of the Onboarding and Financial Crime team of the startup commercial bank. My role extends to specialised areas such as transaction monitoring, client onboarding processes, and various risk & compliance related systems. My responsibilities extend to leading projects and delivering critical features and capabilities.",
            "location": "London / Fully Remote",
            "started": 2023,
            "ended": "now",
            "stack": [
                "Clojure",
                "ClojureScript"
            ],
            "role": "Senior Software Engineer"
        },
        {
            "company": "MLabs",
            "description": "Part of a Haskell and Rust Software consultancy, I had the opportunity to work for a multitude of clients and projects, including developer tooling, compilers, blockchain decentralised apps, technical audits, and protocol designs. The work involved scope discovery and the delivery of the solution end to end, in many situations within constricted timelines, budgets and resourcing - all done on top of rapidly changing codebases. Given the mentioned context, I had to deliver quantifiable value for our clients - having the opportunity of leading a couple of projects as the Tech Lead of small (3 to 4 person) teams.",
            "location": "UK / Fully Remote",
            "started": 2021,
            "ended": 2023,
            "stack": [
                "Haskell",
                "Rust"
            ],
            "role": "Tech Lead / Auditor"
        },
        {
            "company": "Future Joinery Systems",
            "location": "UK / Bath / Fully Remote",
            "description": "Startup involved in Construction Industry Software Innovation. Development, and deployment of a web application, API and a suite of Plugins for 3D modeling applications. My role in the team involved working on all the aspects of the product, with an emphasis on the Dev-ops and infrastructure of the project.",
            "started": 2020,
            "ended": 2021,
            "stack": [
                "JavaScript",
                "TypeScript"
            ],
            "role": "Software Engineer"
        },
        {
            "company": "Evidify",
            "description": "A start-up focused on producing tooling for data gathering from the public domain, and the automated analysis of costing / rating of architectural layouts using ML and AI algorithms. Business plan was based on creating and providing insightful analysis of real-estate as a service.",
            "started": 2018,
            "ended": 2020,
            "stack": [
                "python"
            ],
            "role": "Software Engineer"
        }
    ],
    "education": [
        ["MSc:", "Computer Science", "@University Of Bath", "~ 2020 - 2021"],
        ["PGCert:", "Professional Practice", "@University Of Bath", "~ 2018 - 2019"],
        ["MArch:", "Masters of Architecture", "@University Of Cardiff", "~ 2015 - 2017"],
        ["BSc:", "Architectural Studies", "@University Of Cardiff", "~ 2012 - 2015"],
        ["CD:", "Mathematics & Computer Science", "@College \"Petru Rares\" Suceava", "~ 2009 - 2012"]
    ],
    "awards": [
        [":ledger:", "2021: Showcode, @UniCode (Finals)", ""],
        [":trophy:", "2021: Optiver Challenge, @Hack the Burgh Hackathon", "- 1st place"],
        [":ledger:", "2020: @Oxford Hacks Hackathon", ""],
        [":ledger:", "2020: @UKIEPC", ""],
        [":ledger:", "2012: Nationals, @Romanian Computer Science Olympiad"],
        [":trophy:", "2012: County, @Romanian Computer Science Olympiad", "- 2nd place"],
        [":ledger:", "2011: County, @Romanian Computer Science Olympiad"],
        [":ledger:", "2010: County, @Romanian Computer Science Olympiad"],
        [":ledger:", "2009: County, @Romanian Computer Science Olympiad"]
    ]
}